Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents class contains the identifiers for key input events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputRequested
Expected identification string for numeric input request events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCompleted
Expected identification string for numeric input completion events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCanceled
Expected identification string for numeric input cancel events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived
Expected identification string for input received events.